import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class ConfigService {

  sex: any = [
    { id: "F", text: "Female" },
    { id: "M", text: "Male" }
  ];
  bloodtype: any = [
    { id: "A", text: "A" },
    { id: "B", text: "B" },
    { id: "AB", text: "AB" },
    { id: "O", text: "O" }
  ];
  status: any = [
    { id: "โสด", text: "โสด" },
    { id: "สมรส", text: "สมรส" },
    { id: "หม้าย", text: "หม้าย" },
    { id: "หย่า", text: "หย่า" },
    { id: "แยกกันอยู่", text: "แยกกันอยู่" }
  ];
  religion = [
    { id: "พุทธ", text: "พุทธ" },
    { id: "คริสต์", text: "คริสต์" },
    { id: "อิสลาม", text: "อิสลาม" }
  ];
  career: any = [
    { id: "กวี", text: "กวี" },
    { id: "เกษตรกร", text: "เกษตรกร" },
    { id: "ข้าราชการ", text: "ข้าราชการ" },
    { id: "คนขับรถแท็กซี่", text: "คนขับรถแท็กซี่" },
    { id: "ค้าขาย", text: "ค้าขาย" },
    { id: "โฆษก", text: "โฆษก" },
    { id: "จ๊อกกี้", text: "จ๊อกกี้" },
    { id: "จิตรกร", text: "จิตรกร" },
    { id: "เจ้าหน้าที่พัฒนาเอกชน", text: "เจ้าหน้าที่พัฒนาเอกชน" },
    { id: "เจ้าหน้าทีรักษาความปลอดภัย", text: "เจ้าหน้าทีรักษาความปลอดภัย" },
    { id: "เจ้าหน้าที่รัฐบาล", text: "เจ้าหน้าที่รัฐบาล" },
    { id: "ช่างทำเครื่องดนตรี", text: "ช่างทำเครื่องดนตรี" },
    { id: "ช่างทำผม", text: "ช่างทำผม" },
    { id: "ตำรวจ", text: "ตำรวจ" },
    { id: "ทนายความ", text: "ทนายความ" },
    { id: "ทหารบก", text: "ทหารบก" },
    { id: "นักกฎหมาย", text: "นักกฎหมาย" },
    { id: "นักการกุศล", text: "นักการกุศล" },
    { id: "นักการทูต", text: "นักการทูต" },
    { id: "นักการเมือง", text: "นักการเมือง" },
    { id: "นักการศึกษา", text: "นักการศึกษา" },
    { id: "นักกีฬา", text: "นักกีฬา" },
    { id: "นักเขียน", text: "นักเขียน" },
    { id: "นักคณิตศาสตร์", text: "นักคณิตศาสตร์" },
    { id: "นักเคลื่อนไหว", text: "นักเคลื่อนไหว" },
    { id: "นักจัดรายการวิทยุ", text: "นักจัดรายการวิทยุ" },
    { id: "นักจิตวิทยา", text: "นักจิตวิทยา" },
    { id: "นักชีววิทยา", text: "นักชีววิทยา" },
    { id: "นักดนตรี", text: "นักดนตรี" },
    { id: "นักดาราศาสตร์", text: "นักดาราศาสตร์" },
    { id: "นักแต่งเพลง", text: "นักแต่งเพลง" },
    { id: "นักถ่ายภาพ", text: "นักถ่ายภาพ" },
    { id: "นักธุรกิจ", text: "นักธุรกิจ" },
    { id: "นักบวช", text: "นักบวช" },
    { id: "นักบิน", text: "นักบิน" },
    { id: "นักบินอวกาศ", text: "นักบินอวกาศ" },
    { id: "นักโบราณคดี", text: "นักโบราณคดี" },
    { id: "นักประชาสัมพันธ์", text: "นักประชาสัมพันธ์" },
    { id: "นักประดิษฐ์", text: "นักประดิษฐ์" },
    { id: "นักประวัติศาสตร์", text: "นักประวัติศาสตร์" },
    { id: "นักปรัชญา", text: "นักปรัชญา" },
    { id: "นักแปล", text: "นักแปล" },
    { id: "นักผจญภัย", text: "นักผจญภัย" },
    { id: "นักพจนานุกรม", text: "นักพจนานุกรม" },
    { id: "นักพากย์", text: "นักพากย์" },
    { id: "นักภาษาศาสตร์", text: "นักภาษาศาสตร์" },
    { id: "นักโภชนาการ", text: "นักโภชนาการ" },
    { id: "นักมายากล", text: "นักมายากล" },
    { id: "นักวาดการ์ตูน", text: "นักวาดการ์ตูน" },
    { id: "นักวิจัย", text: "นักวิจัย" },
    { id: "นักวิทยาศาสตร์", text: "นักวิทยาศาสตร์" },
    { id: "นักเศรษฐศาสตร์", text: "นักเศรษฐศาสตร์" },
    { id: "นักสะสมศิลปะ", text: "นักสะสมศิลปะ" },
    { id: "นักสังคมวิทยา", text: "นักสังคมวิทยา" },
    { id: "นักสังคมศาสตร์", text: "นักสังคมศาสตร์" },
    { id: "นักสังคมสงเคราะห์", text: "นักสังคมสงเคราะห์" },
    { id: "นักสัตววิทยา", text: "นักสัตววิทยา" },
    { id: "นักสำรวจ", text: "นักสำรวจ" },
    { id: "นักสิทธิมนุษยชน", text: "นักสิทธิมนุษยชน" },
    { id: "นักสืบ", text: "นักสืบ" },
    { id: "นักแสดง", text: "นักแสดง" },
    { id: "นักหนังสือพิมพ์", text: "นักหนังสือพิมพ์" },
    { id: "นักอนุรักษ์ธรรมชาติ", text: "นักอนุรักษ์ธรรมชาติ" },
    { id: "นักออกแบบ", text: "นักออกแบบ" },
    { id: "นางแบบ", text: "นางแบบ" },
    { id: "นายแบบ", text: "นายแบบ" },
    { id: "บรรณาธิการ", text: "บรรณาธิการ" },
    { id: "บรรณารักษ์", text: "บรรณารักษ์" },
    { id: "โปรแกรมเมอร์", text: "โปรแกรมเมอร์" },
    { id: "ผู้กำกับ", text: "ผู้กำกับ" },
    { id: "ผู้กำกับภาพยนตร์", text: "ผู้กำกับภาพยนตร์" },
    { id: "ผู้กำกับละครโทรทัศน์", text: "ผู้กำกับละครโทรทัศน์" },
    { id: "ผู้จัดพิมพ์", text: "ผู้จัดพิมพ์" },
    { id: "พิธีกร", text: "พิธีกร" },
    { id: "แพทย์", text: "แพทย์" },
    { id: "ภัณฑารักษ์", text: "ภัณฑารักษ์" },
    { id: "เภสัชกร", text: "เภสัชกร" },
    { id: "มัคคุเทศก์", text: "มัคคุเทศก์" },
    { id: "วิศวกร", text: "วิศวกร" },
    { id: "วีเจ", text: "วีเจ" },
    { id: "ศิลปิน", text: "ศิลปิน" },
    { id: "สถาปนิก", text: "สถาปนิก" },
    { id: "อัยการ", text: "อัยการ" },
    { id: "อาจารย์", text: "อาจารย์" }
  ];
  SocialPlatform: any = ['Facebook', 'Twitter'];
  // SocialPlatform: any = ['Facebook'];
  constructor() { }

}
